In [5]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eva   29      Phoenix

In [6]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [7]:
df['Salary'] = [70000, 80000, 65000, 90000, 75000]
df

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   65000
3    David   32      Houston   90000
4      Eva   29      Phoenix   75000

In [8]:
df[df['Age'] > 25]

    Name  Age         City  Salary
1    Bob   27  Los Angeles   80000
3  David   32      Houston   90000
4    Eva   29      Phoenix   75000

In [10]:
df.sort_values(by='Age')

      Name  Age         City  Salary
2  Charlie   22      Chicago   65000
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
4      Eva   29      Phoenix   75000
3    David   32      Houston   90000

In [11]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  76000.000000
std     3.962323   9617.692031
min    22.000000  65000.000000
25%    24.000000  70000.000000
50%    27.000000  75000.000000
75%    29.000000  80000.000000
max    32.000000  90000.000000

In [12]:
# Saving DataFrame to a CSV file
df.to_csv('employee_data.csv', index=False)
print("DataFrame saved to 'employee_data.csv'")

DataFrame saved to 'employee_data.csv'